quick_soap_test.sh

#!/bin/bash
# å¿«é€Ÿ SOAP æµ‹è¯• - ç›´æ¥è°ƒç”¨ onvif_test.sh ä¸­çš„æ–¹æ³•

DEVICE_IP="${1:-192.168.1.250}"
DEVICE_PORT="${2:-8888}"
USERNAME="${3:-test}"
PASSWORD="${4:-a123456789}"
ENDPOINT="http://${DEVICE_IP}:${DEVICE_PORT}/onvif/device_service"

echo "ğŸ§ª å¿«é€Ÿ SOAP æµ‹è¯•"
echo "è®¾å¤‡: $ENDPOINT"
echo ""

# ç”Ÿæˆ WSSE è¯·æ±‚
nonce=$(openssl rand -base64 16)
timestamp=$(date -u +"%Y-%m-%dT%H:%M:%S.000Z")
digest=$(echo -n "$(echo "$nonce" | base64 -d)${timestamp}${PASSWORD}" | openssl sha1 -binary | base64)

request='<?xml version="1.0" encoding="UTF-8"?>
<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope">
  <s:Header>
    <Security s:mustUnderstand="1" xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <UsernameToken>
        <Username>'"$USERNAME"'</Username>
        <Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">'"$digest"'</Password>
        <Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">'"$nonce"'</Nonce>
        <Created xmlns="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">'"$timestamp"'</Created>
      </UsernameToken>
    </Security>
  </s:Header>
  <s:Body>
    <GetSystemDateAndTime xmlns="http://www.onvif.org/ver10/device/wsdl"/>
  </s:Body>
</s:Envelope>'

echo "ã€å‘é€ SOAP è¯·æ±‚ã€‘"
echo "$request" | tee /tmp/test_request.xml
echo ""

echo "ã€è°ƒç”¨è®¾å¤‡ã€‘"
response=$(curl -v -X POST "$ENDPOINT" \
    -H "Content-Type: application/soap+xml; charset=utf-8" \
    -H "SOAPAction: http://www.onvif.org/ver10/device/wsdl/GetSystemDateAndTime" \
    -d "$request" 2>&1)

echo ""
echo "ã€å“åº”ã€‘"
echo "$response" | grep -E "HTTP/|<GetSystemDateAndTimeResponse|é”™è¯¯:|<html>"

if echo "$response" | grep -q "GetSystemDateAndTimeResponse"; then
    echo ""
    echo "âœ… æˆåŠŸï¼è®¾å¤‡è¿”å›äº†æ­£ç¡®çš„ SOAP å“åº”"
else
    echo ""
    echo "âŒ å¤±è´¥ï¼è®¾å¤‡è¿”å›äº†é”™è¯¯"
fi
